{"id":11231,"date":"2020-08-24T16:09:03","date_gmt":"2020-08-24T16:09:03","guid":{"rendered":"http:\/\/fabeat.in\/?p=11231"},"modified":"2020-08-25T22:38:18","modified_gmt":"2020-08-25T22:38:18","slug":"obesity-the-causesrisks-and-cure-explained","status":"publish","type":"post","link":"https:\/\/www.fabeat.in\/obesity-the-causesrisks-and-cure-explained\/","title":{"rendered":"Obesity-The Causes,Risks And Cure Explained"},"content":{"rendered":"\n<div class=\"wp-block-cover has-background-dim alignwide\" style=\"background-image:url(http:\/\/www.fabeat.in\/wp-content\/uploads\/2020\/08\/4.jpg)\"><div class=\"wp-block-cover__inner-container\">\n<p class=\"has-text-align-center has-large-font-size\"><\/p>\n<\/div><\/div>\n\n\n\n<p>Obesity has far progressed from being a body image issue to the biggest approximated silent killer of the millennials. The overdose of junk foods and erratic eating patterns have triggered obesity in the masses. Apart from being overweight, an obese person is at higher risk heart, pressure and diabetic diseases as well.&nbsp;<\/p>\n\n\n\n<p>Some of the most typical reasons for a person to get obese are:<\/p>\n\n\n\n<ol><li>Diet- Eating fat\/energy rich foods instead of nutritious fruits\/vegetables\/nuts high in protein and fibres. Emotional eating, especially when stressed, angry, moody etc also leads to eating large and unwanted quantities of foods, leading to weight gain<\/li><li>Genetics- Genetics influence obesity to an extent. Factors like metabolism, appetite, cravings, etc are governed to a certain extent by genetics and its influence varies from person to person.<\/li><li>Sleep habits- Erratic sleep induces hormonal issues which are significantly linked to weight gain. Long work hours, stress, insomnia all triggers weight gain eventually.&nbsp;<\/li><\/ol>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\"\/><\/figure>\n\n\n\n<p>Now that we know the most common reasons that cause obesity, let’s look at some preventive measures.<\/p>\n\n\n\n<ol><li>Proper diet<br>Consuming foods with lower carbs and fat yet high in proteins and fibres is the first and best step when it comes to bringing your body back to balance. Consume fewer calories and make sure you don’t binge eat. If you’re craving food or are an impulsive snacker, make sure you stick to nutritious foods like nuts or salads.&nbsp;<\/li><li>Exercise<br>A complete no brainer when it comes to getting a healthy body, exercising is supremely mandatory to get your curves back. Start with simple steps like taking the stairs, cycling to work, simple home workouts etc, and gradually&nbsp; work your way up to high intensity cardio and weight training. The results are outstanding, though it comes after crossing several hurdles.&nbsp;<\/li><li>Keep stress at bay<br>Stress induces anxiety, which then propels people into overeating, especially of low nutrition readily available junk food. Make sure you do not let stress get the better of you. Simple practices like yoga, meditation and walking can help beat the frown.<\/li><li>Sleep<br>Nothing restores and repairs your body and mind like a long, sound sleep can. Apart from its healing abilities, good sleep means balanced hormones which in turn promises a well functioning body.<\/li><\/ol>\n\n\n\n<p>Keep an eye on what you’re eating, exercise consistently and make sure you clock in your regular hours at sleep and you don’t have to worry about obesity and the subsequent diseases it brings.<br><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-right\"><\/p>\n\n\n\n<p><\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p> “If you keep on eating unhealthy food than no matter how many weight loss tips you follow, you are likely to retain weight and become obese. If only you start eating healthy food, you will be pleasantly surprised how easy it is to lose weight.” <\/p><cite> <strong>Subodh Gupta,&nbsp;<\/strong><a href=\"https:\/\/www.goodreads.com\/work\/quotes\/25316033\">7 habits of skinny woman<\/a> <\/cite><\/blockquote>\n","protected":false},"excerpt":{"rendered":"<p>Obesity has far progressed from being a body image issue to the biggest approximated silent killer of the millennials. The overdose of junk foods and erratic eating patterns have triggered obesity in the masses. Apart from being overweight, an obese person is at higher risk heart, pressure and diabetic diseases as well.&nbsp; Some of the most typical reasons for a person to get obese are: Diet- Eating fat\/energy rich foods instead of nutritious fruits\/vegetables\/nuts high in protein and fibres. Emotional eating, especially when stressed, angry, moody etc also leads to eating large and unwanted quantities of foods, leading to weight gain Genetics- Genetics influence obesity to an extent. Factors like metabolism, appetite, cravings, etc are governed to a certain extent by genetics and its influence varies from person to person. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[305],"tags":[],"jetpack_featured_media_url":"","amp_validity":null,"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/www.fabeat.in\/wp-json\/wp\/v2\/posts\/11231"}],"collection":[{"href":"https:\/\/www.fabeat.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.fabeat.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.fabeat.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.fabeat.in\/wp-json\/wp\/v2\/comments?post=11231"}],"version-history":[{"count":3,"href":"https:\/\/www.fabeat.in\/wp-json\/wp\/v2\/posts\/11231\/revisions"}],"predecessor-version":[{"id":11711,"href":"https:\/\/www.fabeat.in\/wp-json\/wp\/v2\/posts\/11231\/revisions\/11711"}],"wp:attachment":[{"href":"https:\/\/www.fabeat.in\/wp-json\/wp\/v2\/media?parent=11231"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.fabeat.in\/wp-json\/wp\/v2\/categories?post=11231"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.fabeat.in\/wp-json\/wp\/v2\/tags?post=11231"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}